app/Helpers/custom_helper.php

	function getRole($role_id)
	{
		$db = \Config\Database::connect();
		$permissionList = array();

		$permission = $db->table('role_permission AS rp')
			->select('p.permission_description AS permission_description')
			->join('permission AS p', 'p.permission_id = rp.permission_id', 'left')
			->where('rp.role_id', $role_id)->get()->getResult();
---
SELECT `p`.`permission_description` AS `permission_description`
FROM `role_permission` AS `rp`
LEFT JOIN `permission` AS `p` ON `p`.`permission_id` = `rp`.`permission_id`
WHERE `rp`.`role_id` = '2'

	function loadRoles()
	{
		$db = \Config\Database::connect();

		$user = $db->table('user')->where('username', session()->get('username'))->get()->getRow();

		$fetchRoles = $db->table('user AS u')
			->select('u.role_id AS role_id, r.role_name AS role_name')
			->join("role AS r", "r.role_id = u.role_id", "left")
			->where("u.user_id", $user->user_id)
			->get()->getResult();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
SELECT `u`.`role_id` AS `role_id`, `r`.`role_name` AS `role_name`
FROM `user` AS `u`
LEFT JOIN `role` AS `r` ON `r`.`role_id` = `u`.`role_id`
WHERE `u`.`user_id` = '2'