app/Controllers/About.php

SELECT *
FROM `about`
 LIMIT 1
---
    public function index()
    {
        if (!user_can('view-about')) {
            return redirect()->to(base_url('/dashboard/invalid'));
        }

        $data['title'] = "About";
        $this->breadcrumb->add('Dashboard', '/dashboard');
        $this->breadcrumb->add('About', '/about/index');
        $data['breadcrumbs'] = $this->breadcrumb->render();

        $data['about'] = $this->about_model->first();