app/Controllers/Dashboard.php

SELECT *
FROM `people_said`
WHERE `active` = 0
SELECT *
FROM `people_said`
SELECT *
FROM `news`
SELECT *
FROM `user`
---
    public function index()
    {
    	$data['title'] = "Dashboard";
    	$this->breadcrumb->add('Dashboard', '/dashboard');
    	$data['breadcrumbs'] = $this->breadcrumb->render();

        $data['people_said'] = $this->peoplesaid_model->where('active',0)->find();
        $data['count_people'] = count($this->peoplesaid_model->findAll());
        $data['count_news'] = count($this->news_model->findAll());
        $data['count_user'] = count($this->user_model->findAll());