app/Controllers/Gis_facilities.php

   public function add()
   {

      helper(['form', 'url']);

      if (!user_can('create-facilities')) {
         return redirect()->to(base_url('/dashboard/invalid'));
      }

      $data['title'] = "Add Facilities";
      $data['content'] = 'image';

      $this->breadcrumb->add('Dashboard', '/dashboard');
      $this->breadcrumb->add('List Facilities', '/gis_facilities');
      $this->breadcrumb->add('Add', '/gis_facilities/add');
      $data['breadcrumbs'] = $this->breadcrumb->render();

      $data['category'] = $this->category_facilities->findAll();
---
SELECT *
FROM `gis_category_facilities`

               'longitude' => $longitude,
            ];

            $simpan = $this->facilities->insert($data);
---
INSERT INTO `gis_facilities` (`category_facilities_id`, `title`, `image_name`, `description`, `latitude`, `longitude`) VALUES ('3', 'wisata morut', '1666358447_fe8238386e788bff16e6.png', 'loremloremlorem', '-1.5818302639606454', '121.50339110058763')

   public function delete($id)
   {

      if (!user_can('delete-facilities')) {
         return redirect()->to(base_url('/dashboard/invalid'));
      }

      $facilities = $this->facilities->where(['facilities_id' => $id])->first();
      unlink('img/gis/facilities/' . $facilities->image_name);

      $this->facilities->delete($id);
---
SELECT *
FROM `gis_facilities`
WHERE `facilities_id` = '1'
 LIMIT 1
DELETE FROM `gis_facilities`
WHERE `facilities_id` IN ('1')