app/Controllers/Gis_category_facilities.php

   public function delete($id)
   {

      if (!user_can('delete-category-facilities')) {
         return redirect()->to(base_url('/dashboard/invalid'));
      }

      $post = $this->category_facilities->find($id);

      if ($post) {
         unlink('icon/gis/' . $post->category_icon);
         $this->category_facilities->delete($id);
---
SELECT *
FROM `gis_category_facilities`
WHERE `gis_category_facilities`.`category_facilities_id` = '3'
DELETE FROM `gis_category_facilities`
WHERE `category_facilities_id` IN ('3')