app/Controllers/Home.php

    public function index()
    {
        $data['data_news'] = $this->news_model->gt_dataLimit(3);
        $data['data_gallery_foto'] = $this->gallery_model->gt_dataLimitFoto(12);
        $data['category'] = $this->category_gallery->findAll();
        $data['data_gallery_video'] = $this->gallery_model->gt_dataLimitVideo(6);
        $data['people_said'] = $this->peoplesaid_model->gt_findLimit(12);
        $data['agenda_kab'] = $this->agenda_model->gt_findLimit(3, 'Kabupaten / Pemerintahan');
        $data['agenda_mas'] = $this->agenda_model->gt_findLimit(3, 'Masyarakat');
        $data['setting'] = $this->setting_model->first();
---
SELECT *
FROM `category_gallery`
SELECT *
FROM `setting`
 LIMIT 1

    public function program($slug = null)
    {
        if (empty($slug)) {
            $this->breadcrumb->add('Beranda', '/home/index');
            $this->breadcrumb->add('Priority Program', '/home/program');
            $data['breadcrumbs'] = $this->breadcrumb->render();
            $data['setting'] = $this->setting_model->first();
            $data['profile'] = $this->category_menu->get_category_menu('profile');
            $data['information'] = $this->category_menu->get_category_menu('information');
            $data['program'] = $this->priority_program->findAll();

            $data['slug'] = null;
        } else {
            $this->breadcrumb->add('Beranda', '/home/index');
            $this->breadcrumb->add('Priority Program', '/home/program');
            $data['breadcrumbs'] = $this->breadcrumb->render();
            $data['setting'] = $this->setting_model->first();
---
SELECT *
FROM `setting`
 LIMIT 1