app/Controllers/Home.php

    public function signup()
    {
        if (check_token('login', $this->request->getVar('token'))) {
            $username = $this->request->getVar('username');
            $password = $this->request->getVar('password');

            $dataUser = $this->user_model->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1