app/Controllers/WebGis.php

SELECT *
FROM `gis_batas_kecamatan`
SELECT *
FROM `setting`
 LIMIT 1
---
    public function Gis($category_name)
    {
        $this->breadcrumb->add('Beranda', '/home/index');
        $this->breadcrumb->add('Gis Medical Facility', '/WebGis/GisMedicalFacility/');
        $data['breadcrumbs'] = $this->breadcrumb->render();

        $data['batas_kecamatan'] = $this->batas_kecamatan->findAll();
        $data['data_gis'] = $this->facilities->gt_data_gis($category_name);
        $data['setting'] = $this->setting_model->first();

SELECT *
FROM `gis_batas_kecamatan`
SELECT *
FROM `setting`
 LIMIT 1
---
    public function GisBatasKecamatan()
    {
        $this->breadcrumb->add('Beranda', '/home/index');
        $this->breadcrumb->add('Gis Batas Kecamatan', '/WebGis/GisBatasKecamatan/');
        $data['breadcrumbs'] = $this->breadcrumb->render();

        $data['batas_kecamatan'] = $this->batas_kecamatan->findAll();
        $data['setting'] = $this->setting_model->first();