app/Controllers/Welcome.php

SELECT *
FROM `gis_batas_kecamatan`
SELECT *
FROM `setting`
 LIMIT 1
---
    public function index()
    {
        $data['batas_kecamatan'] = $this->batas_kecamatan->findAll();
        $data['gis'] = $this->facilities->gt_dataAll();
        $data['medical_facility'] = $this->facilities->gt_medical_facility();
        $data['bupati'] = $this->flash_model->gt_dataPosition('Bupati Morowali Utara');
        $data['wabup'] = $this->flash_model->gt_dataPosition('Wakil Bupati Morowali Utara');
        $data['setting'] = $this->setting_model->first();