app/Models/AgendaModel.php

SELECT `n`.*
FROM `agenda` AS `n`
WHERE `n`.`category` = 'Kabupaten / Pemerintahan'
ORDER BY `n`.`agenda_id` DESC
 LIMIT 3
---
    public function gt_findLimit($limit, $category = null)
    {
        $this->builder = $this->db->table($this->table . ' AS n');
        $this->builder->select('n.*');
        $this->builder->where('n.category', $category);
        $this->builder->orderBy('n.agenda_id','DESC');
        $this->builder->limit($limit);

        $query = $this->builder->get();