app/Models/CategorymenuModel.php

    public function get_category_menu($menu){

        $this->builder = $this->db->table('category_menu');
        $this->builder->select('*');
        $this->builder->where('menu', $menu);

        $category = $this->builder->get()->getResult();

        foreach ($category as $key => $value) {
            $sub_cat = $this->db->table('content_menu AS cnm')->select('cnm.menu_id AS content_id, cnm.title AS title')->where('cnm.category_menu_id',$value->category_menu_id);
            $result[$value->category]['sub_cat'] = $sub_cat->get()->getResult();
---
SELECT *
FROM `category_menu`
WHERE `menu` = 'profile'
SELECT `cnm`.`menu_id` AS `content_id`, `cnm`.`title` AS `title`
FROM `content_menu` AS `cnm`
WHERE `cnm`.`category_menu_id` = '1'