app/Models/GalleryModel.php

SELECT `g`.`gallery_id` AS `gallery_id`, `g`.`content` AS `content`, `cg`.`category_name` AS `category_name`
FROM `gallery` AS `g`
LEFT JOIN `category_gallery` AS `cg` ON `cg`.`category_gallery_id` = `g`.`category_gallery_id`
WHERE `option` = 'image'
ORDER BY `gallery_id` DESC
 LIMIT 12
---
    public function gt_dataLimitFoto($limit)
    {
        $this->builder = $this->db->table($this->table . ' AS g');
        $this->builder->select('g.gallery_id AS gallery_id, g.content AS content, cg.category_name AS category_name');
        $this->builder->where('option', 'image');
        $this->builder->join('category_gallery AS cg', 'cg.category_gallery_id = g.category_gallery_id', 'left');
        $this->builder->orderBy('gallery_id','DESC');
        $this->builder->limit($limit);

        $query = $this->builder->get();

SELECT `g`.`gallery_id` AS `gallery_id`, `g`.`content` AS `content`, `cg`.`category_name` AS `category_name`
FROM `gallery` AS `g`
LEFT JOIN `category_gallery` AS `cg` ON `cg`.`category_gallery_id` = `g`.`category_gallery_id`
WHERE `option` = 'video'
 LIMIT 6
---
    public function gt_dataLimitVideo($limit)
    {
        $this->builder = $this->db->table($this->table . ' AS g');
        $this->builder->select('g.gallery_id AS gallery_id, g.content AS content, cg.category_name AS category_name');
        $this->builder->where('option', 'video');
        $this->builder->join('category_gallery AS cg', 'cg.category_gallery_id = g.category_gallery_id', 'left');
        $this->builder->limit($limit);

        $query = $this->builder->get();