app/Models/GiscategoryfacilitiesModel.php

    public function count_filtered($table, $column_order, $column_search, $order, $data = '')
    {
        $this->_get_datatables_query($table, $column_order, $column_search, $order);
        if ($data) {
            $this->builder->where($data);
        }
        $this->builder->get();
        return $this->builder->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `gis_category_facilities`

    public function count_all($table, $data = '')
    {
        if ($data) {
            $this->builder->where($data);
        }

        $this->builder->from($table);

        return $this->builder->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `gis_category_facilities`