app/Models/GisfacilitiesModel.php

SELECT COUNT(*) AS `numrows` FROM `gis_facilities` AS `f`
---
   public function count_filtered($table, $column_order, $column_search, $order, $data = '')
   {
      $this->_get_datatables_query($table, $column_order, $column_search, $order);
      if ($data) {
         $this->builder->where($data);
      }
      $this->builder->get();
      return $this->builder->countAll();

SELECT COUNT(*) AS `numrows` FROM `gis_facilities` AS `f`
---
   public function count_all($table, $data = '')
   {
      if ($data) {
         $this->builder->where($data);
      }

      $this->builder->from($table);

      return $this->builder->countAll();

SELECT `f`.`facilities_id` AS `facilities_id`, `f`.`title` AS `title`, `f`.`image_name` as `image_name`, `f`.`latitude` AS `latitude`, `f`.`longitude` AS `longitude`, `f`.`description` as `description`, `cf`.`category_name` AS `category_name`, `cf`.`category_facilities_id` AS `category_facilities_id`
FROM `gis_facilities` AS `f`
LEFT JOIN `gis_category_facilities` as `cf` ON `cf`.`category_facilities_id` = `f`.`category_facilities_id`
---
   public function gt_dataAll()
   {
      $this->builder = $this->db->table($this->table . ' AS f');
      $this->builder->select('f.facilities_id  AS facilities_id , f.title AS title, f.image_name as image_name ,f.latitude AS latitude, f.longitude AS longitude, f.description as description, cf.category_name AS category_name, cf.category_facilities_id AS category_facilities_id, cf.category_icon AS category_icon');
      $this->builder->join('gis_category_facilities as cf', 'cf.category_facilities_id = f.category_facilities_id', 'left');

      $query = $this->builder->get();

SELECT `f`.`facilities_id` AS `facilities_id`, `f`.`title` AS `title`, `f`.`image_name` as `image_name`, `f`.`latitude` AS `latitude`, `f`.`longitude` AS `longitude`, `f`.`description` as `description`, `cf`.`category_name` AS `category_name`, `cf`.`category_facilities_id` AS `category_facilities_id`, `cf`.`category_icon` AS `category_icon`
FROM `gis_facilities` AS `f`
LEFT JOIN `gis_category_facilities` as `cf` ON `cf`.`category_facilities_id` = `f`.`category_facilities_id`
WHERE `category_name` = 'pelayanan publik'
---
   public function gt_data_gis($category_name)
   {
      $this->builder = $this->db->table($this->table . ' AS f');
      $this->builder->select('f.facilities_id  AS facilities_id , f.title AS title, f.image_name as image_name ,f.latitude AS latitude, f.longitude AS longitude, f.description as description, cf.category_name AS category_name, cf.category_facilities_id AS category_facilities_id, cf.category_icon AS category_icon ');
      $this->builder->where('category_name ', $category_name);
      $this->builder->join('gis_category_facilities as cf', 'cf.category_facilities_id = f.category_facilities_id', 'left');

      $query = $this->builder->get();