app/Models/NewsModel.php

SELECT `n`.`title` AS `title`, `n`.`news_id` AS `news_id`, `n`.`user_id` AS `user_id`, `n`.`image_name` AS `image_name`, `n`.`content` AS `content`, `u`.`name` AS `user_name`, `cn`.`category_news_id` AS `category_news_id`, `cn`.`category_name` AS `category_name`, `n`.`updated_at` AS `created_at`, `n`.`slug` AS `slug`
FROM `news` AS `n`
LEFT JOIN `user` as `u` ON `u`.`user_id` = `n`.`user_id`
LEFT JOIN `category_news` as `cn` ON `cn`.`category_news_id` = `n`.`category_news_id`
ORDER BY `n`.`news_id` DESC
 LIMIT 3
---
    public function gt_dataLimit($limit)
    {
        $this->builder = $this->db->table($this->table . ' AS n');
        $this->builder->select('n.title AS title, n.news_id AS news_id, n.user_id AS user_id, n.image_name AS image_name, n.content AS content, u.name AS user_name,cn.category_news_id AS category_news_id, cn.category_name AS category_name, n.updated_at AS created_at, n.slug AS slug');
        $this->builder->join('user as u', 'u.user_id = n.user_id', 'left');
        $this->builder->join('category_news as cn', 'cn.category_news_id = n.category_news_id', 'left');
        $this->builder->orderBy('n.news_id','DESC');
        $this->builder->limit($limit);

        $query = $this->builder->get();