app/Models/PeoplesaidModel.php

SELECT `n`.*
FROM `people_said` AS `n`
WHERE `active` = 1
ORDER BY `n`.`id` DESC
 LIMIT 12
---
    public function gt_findLimit($lmt)
    {
        $this->builder = $this->db->table($this->table . ' AS n');
        $this->builder->select('n.*');
        $this->builder->where('active',1);
       	$this->builder->limit($lmt);
        $this->builder->orderBy('n.id','DESC');

        $query = $this->builder->get();