app/Models/PriorityprogramModel.php

SELECT `p`.`title` AS `title`, `p`.`id_priority` AS `id_priority`, `p`.`slug` AS `slug`, `p`.`description` AS `description`, `p`.`content` AS `content`
FROM `priority_program` AS `p`
WHERE `slug` = 'bantuan-beras'
---
   public function get_dataSlug($slug)
   {
      $this->builder = $this->db->table($this->table . ' AS p');
      $this->builder->select('p.title AS title, p.id_priority AS id_priority,  p.slug AS slug,p.description AS description, p.content AS content');
      $this->builder->where('slug', $slug);
      $query = $this->builder->get();